<h3>Imports</h3>

In [196]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
import matplotlib.pyplot as plt             #visualisation
%matplotlib inline

<h3>Loading the data into the data frame</h3>

In [197]:
df = pd.read_csv("../Data/train.csv")

<h3>Descovering Data</h3>

In [198]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [199]:
#remove PassengerId, Name not important 
df = df.drop(["PassengerId","Name"],axis=1)
df.head(5)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [200]:
df.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [201]:
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

<ol>
    <li>Age,Cabin,Embarked has null values</li>
    <li>Age is Quantitative and Cabin,Embarked Categorical</li>
</ol>

<h3>Dealing with Categorized Data</h3>

In [202]:
#sex,ticket,cabin,Embarked are categorical data
#cabin,Embarked have missing data

In [203]:
percent_Cabin_missing = (df.isna().sum().Cabin)/len(df.Cabin)
print(percent_Cabin_missing)
#more than 70% drop Col
df = df.drop(["Cabin"],axis=1)

0.7710437710437711

In [204]:
#all Tickets has 1 to 4 survivors not important
df = df.drop(["Ticket"],axis=1)

In [205]:
#embarked has 3 unquie valuess given in problem C = Cherbourg, Q = Queenstown, S = Southampton
#sex has 2 unquie values given in problem female male
Embarked_mode = df.Embarked.mode()#S
df['Embarked'+"_was_missing"] = df['Embarked'].isna()
df['Embarked'] = df['Embarked'].fillna('S')
df['Embarked'] = df['Embarked'].replace(['C'],1)
df['Embarked'] = df['Embarked'].replace(['Q'],2)
df['Embarked'] = df['Embarked'].replace(['S'],3)
df['Sex'] = df['Sex'].replace(['male'],0)
df['Sex'] = df['Sex'].replace(['female'],1)

<h3>Splitting Data</h3>

In [206]:
y = df.Survived#Target Variable
X = df.drop(["Survived"],axis=1)#
# Divide data into training and validation subsets
X_train, X_valid, y_train, y_valid = train_test_split(X, y, train_size=0.8, test_size=0.2,
                                                      random_state=0)

<h3>Dealing with Missing Data</h3>

In [207]:
#Age (Quantitative Data) only left dealt with cabin by removing and Embarked got the mode and added new columns
# Make copy to avoid changing original data (when imputing)
# X_train_plus = X_train.copy()
# X_valid_plus = X_valid.copy()

# # Make new columns indicating what will be imputed
# X_train_plus["Age" + '_was_missing'] = X_train_plus["Age"].isnull()
# X_valid_plus["Age" + '_was_missing'] = X_valid_plus["Age"].isnull()

# # Imputation
# my_imputer = SimpleImputer()
# imputed_X_train_plus = pd.DataFrame(my_imputer.fit_transform(X_train_plus))
# imputed_X_valid_plus = pd.DataFrame(my_imputer.transform(X_valid_plus))

# # Imputation removed column names; put them back
# imputed_X_train_plus.columns = X_train_plus.columns
# imputed_X_valid_plus.columns = X_valid_plus.columns